{
    "personal": {
        "name":       "Joseph R. Shaw", 
        "github":     "https://github.com/tanenbaum",
        "address":    "n/a",
        "phone":      "n/a", 
        "email":      "n/a"
    },

    "employment": [
        {
            "where":    "X-Lab Ltd, Leeds",
            "when":     "2010 - present",
            "title":    "Senior Developer",
            "_meta":    [ 
                            "Responsible for the delivery and ongoing support of scalable, distributed healthcare systems.",

                            "Led development of a large patient-reported outcome measures web application. Complex questionnaires are created by end users and are delivered to patients by means of an event driven schedule. The system enables dynamic scoring/calculations by means of an embedded language.",

                            "Integrated an open source federated identity solution into a regional patient management system.",

                            "Worked within various layers of a national pathology messaging service.",

                            "Leading, mentoring and encouraging the success of the team members. Proactive in encouraging collaboration, providing feedback and raising standards in development.",

                            "Worked closely with numerous clients, from project inception through to sign-off. Used agile methods to deliver systems that meet expectations; justifying technical decisions where necessary",

                            "Steered company-wide technology and software development strategies. Supported the introduction of end-to-end UI testing, continuous integration of all projects and peer code review." 
                        ]
        },
        {
            "where":    "University of Leeds",
            "when":     "2009 - 2010",
            "title":    "Postgraduate Research",
            "_meta":    [ 
                            "Use of functional languages and applications in GPGPU parallel programming.", 

                            "Creating a domain-specific embedded language, targeting graphics pipelines and hardware design" 
                        ]
        },
        {
            "where":    "SourceIT",
            "when":     "2008 - 2010",
            "title":    "Software Consultant",
            "_meta":    [ 
                            "Windows/Symbian phone implementations of a nutritional management application.",

                            "Various web development projects, including a bespoke social networking community for fertility planning." 
                        ]
        },
        {
            "where":    "Biossystems Group, University of Leeds",
            "when":     "2009",
            "title":    "Internship Student",
            "_meta":    [ 
                            "Real-time rendering of an AI nematode worm simulation within a simple desktop application.",

                            "Introduction of user/worm interaction, generating neuron stimulation within the model." 
                        ]
        }
    ],

    "education": [
        {
            "type":     "B.Sc. Computing",
            "grade":    "First-class honours",
            "where":    "University of Leeds",
            "when":     "2006 - 2009",
            "_meta":    [ 
                            "Specialised in the study of artificial intelligence and operations research.",

                            "My finalist project concentrated on swarm intelligence, particularly of ant colonies, with respect to sorting and clustering. Using BEAST (Bioinspired Evolutionary Agent Simulation Toolkit), I could leverage neural networks and genetic algorithms to produce a bio-inspired AI alternative to the traditional mathematical model of insect behaviour." 
                        ]
        },
        {
            "type":     "A-Levels",
            "grade":    "Computing, Physics, Use of Mathematics, Music Technology",
            "where":    "Barnsley College",
            "when":     "2004 - 2006"
        }
    ],

    "achievements": [
        {
            "what":     "Dean's List",
            "where":    "University of Leeds",
            "when":     "2007 and 2008",
            "_meta":    "Awarded to students with a top 5% grade in the Faculty of Engineering."
        },
        {
            "what":     "Outstanding achievement in Computing",
            "where":    "Barsley College",
            "when":     "2006",
            "_meta":    "Awarded for an outstanding performance in A-level Computing."
        }
    ],

    "languages": {
        "primary":    "C#, F#, Haskell, JavaScript",
        "secondary":  "Python, VB, C++",
        "familiar":   "Java, C, shell scripting"
    },

    "applications": {
        "platforms":  ".NET, Node.js, ASP.NET, Azure",
        "libraries":  "EntityFramework, SignalR, FParsec, Knockout, Backbone"
    },

    "interests": "Programming, travel, film, science fiction."
}